Repository: friteuseb/semantic_suggestion_solr
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de, es, fr, it

# plugin.title
source: Similar content (Solr)
de: Ähnliche Inhalte (Solr)
es: Contenido similar (Solr)
fr: Contenus similaires (Solr)
it: Contenuti simili (Solr)

# heading
source: Related content
de: Ähnliche Inhalte
es: Contenido relacionado
fr: Contenus similaires
it: Contenuti correlati

# button.view
source: Read more
de: Weiterlesen
es: Leer más
fr: Voir
it: Leggi di più

# score.label
source: Relevance
de: Relevanz
es: Relevancia
fr: Score de similarite
it: Rilevanza

# type.pages
source: Page
de: Seite
es: Página
it: Pagina

# type.tx_news_domain_model_news
source: News
de: Nachricht
es: Noticia
fr: Actualite
it: Notizia

# flexform.sheet.general
source: Settings
de: Einstellungen
es: Configuración
fr: Parametres
it: Impostazioni

# flexform.sheet.display
source: Display
de: Anzeige
es: Visualización
fr: Affichage
it: Visualizzazione

# flexform.sheet.advanced
source: Advanced
de: Erweitert
es: Avanzado
fr: Avance
it: Avanzato

# flexform.maxResults
source: Maximum number of suggestions
de: Maximale Anzahl der Vorschläge
es: Número máximo de sugerencias
fr: Nombre maximum de suggestions
it: Numero massimo di suggerimenti

# flexform.allowedTypes
source: Allowed content types
de: Erlaubte Inhaltstypen
es: Tipos de contenido permitidos
fr: Types de contenus autorises
it: Tipi di contenuto consentiti

# flexform.allowedTypes.description
source: If none selected, all indexed content types are shown.
de: Wenn keiner ausgewählt ist, werden alle indexierten Inhaltstypen angezeigt.
es: Si no se selecciona ninguno, se muestran todos los tipos de contenido indexados.
fr: Si aucun selectionne, tous les types indexes sont affiches.
it: Se nessuno è selezionato, vengono mostrati tutti i tipi di contenuto indicizzati.

# flexform.allowedTypes.pages
source: Pages
de: Seiten
es: Páginas
it: Pagine

# flexform.allowedTypes.news
source: News articles
de: News-Beiträge
es: Artículos de noticias
fr: Actualites
it: Articoli di notizie

# flexform.filterByPids
source: Restrict to pages / storage folders
de: Auf Seiten / Speicherordner beschränken
es: Restringir a páginas / carpetas de almacenamiento
fr: Restreindre aux pages / dossiers de stockage
it: Limita a pagine / cartelle di archiviazione

# flexform.filterByPids.description
source: Only show suggestions from these locations. For pages: select the parent page. For news/records: select the storage folder. Leave empty for no restriction.
de: Nur Vorschläge von diesen Speicherorten anzeigen. Für Seiten: die übergeordnete Seite auswählen. Für News/Datensätze: den Speicherordner auswählen. Leer lassen für keine Einschränkung.
es: Mostrar solo sugerencias de estas ubicaciones. Para páginas: seleccionar la página padre. Para noticias/registros: seleccionar la carpeta de almacenamiento. Dejar vacío para sin restricción.
fr: N'afficher que les suggestions de ces emplacements. Pour les pages : selectionner la page parente. Pour les news/enregistrements : selectionner le dossier de stockage. Vide = aucune restriction.
it: Mostra solo suggerimenti da queste posizioni. Per le pagine: selezionare la pagina padre. Per notizie/record: selezionare la cartella di archiviazione. Lasciare vuoto per nessuna restrizione.

# flexform.showScore
source: Show relevance score
de: Relevanz-Score anzeigen
es: Mostrar puntuación de relevancia
fr: Afficher le score de similarite
it: Mostra punteggio di rilevanza

# flexform.showContentType
source: Show content type badge
de: Inhaltstyp-Badge anzeigen
es: Mostrar insignia de tipo de contenido
fr: Afficher le badge de type de contenu
it: Mostra badge tipo di contenuto

# flexform.showImage
source: Show image
de: Bild anzeigen
es: Mostrar imagen
fr: Afficher l'image
it: Mostra immagine

# flexform.similarityMode
source: Similarity algorithm
de: Ähnlichkeitsalgorithmus
es: Algoritmo de similitud
fr: Algorithme de similarite
it: Algoritmo di similarità

# flexform.similarityMode.description
source: Auto = detects EXT:solr vector search config (recommended). MLT = lexical (TF-IDF, no model needed). SMLT = Semantic MLT (server-side hybrid combining MLT + vector search via Solr component, requires SMLT JAR).
de: Auto = erkennt die EXT:solr Vektorsuch-Konfiguration (empfohlen). MLT = lexikalisch (TF-IDF, kein Modell nötig). SMLT = Semantisches MLT (serverseitiger Hybrid aus MLT + Vektorsuche via Solr-Komponente, erfordert SMLT-JAR).
es: Auto = detecta la configuración vectorial de EXT:solr (recomendado). MLT = léxico (TF-IDF, sin modelo). SMLT = MLT semántico (híbrido del lado del servidor que combina MLT + búsqueda vectorial via componente Solr, requiere JAR SMLT).
fr: Auto = detecte la config vectorielle EXT:solr (recommande). MLT = lexical (TF-IDF, pas de modele). SMLT = MLT semantique (hybride cote Solr combinant MLT + recherche vectorielle via composant dedie, necessite le JAR SMLT).
it: Auto = rileva la configurazione vettoriale di EXT:solr (consigliato). MLT = lessicale (TF-IDF, nessun modello necessario). SMLT = MLT semantico (ibrido lato server che combina MLT + ricerca vettoriale tramite componente Solr, richiede JAR SMLT).

# flexform.similarityMode.auto
source: Auto – detect from EXT:solr config (recommended)
de: Auto – aus EXT:solr-Konfiguration erkennen (empfohlen)
es: Auto – detectar desde la configuración EXT:solr (recomendado)
fr: Auto – detection depuis la config EXT:solr (recommande)
it: Auto – rileva dalla configurazione EXT:solr (consigliato)

# flexform.similarityMode.mlt
source: MLT – More Like This (lexical)
de: MLT – More Like This (lexikalisch)
es: MLT – More Like This (léxico)
it: MLT – More Like This (lessicale)

# flexform.similarityMode.smlt
source: SMLT – Semantic More Like This (server-side)
de: SMLT – Semantisches More Like This (serverseitig)
es: SMLT – More Like This semántico (del lado del servidor)
fr: SMLT – More Like This semantique (cote Solr)
it: SMLT – More Like This semantico (lato server)

# flexform.minScoreRatio
source: Relevance filter
de: Relevanzfilter
es: Filtro de relevancia
fr: Filtre de pertinence
it: Filtro di rilevanza

# flexform.minScoreRatio.description
source: Filter out suggestions that are too far from the best match. A stricter filter keeps only the most relevant suggestions.
de: Vorschläge herausfiltern, die zu weit vom besten Treffer entfernt sind. Ein strengerer Filter behält nur die relevantesten Vorschläge.
es: Filtrar sugerencias demasiado alejadas del mejor resultado. Un filtro más estricto conserva solo las sugerencias más relevantes.
fr: Ecarter les suggestions trop eloignees du meilleur resultat. Un filtre plus strict ne garde que les suggestions les plus pertinentes.
it: Filtra i suggerimenti troppo distanti dal miglior risultato. Un filtro più rigido conserva solo i suggerimenti più rilevanti.

# flexform.minScoreRatio.none
source: None – show all suggestions
de: Keiner – alle Vorschläge anzeigen
es: Ninguno – mostrar todas las sugerencias
fr: Aucun – afficher toutes les suggestions
it: Nessuno – mostra tutti i suggerimenti

# flexform.minScoreRatio.low
source: Low – at least 30% of best score
de: Niedrig – mindestens 30% des besten Scores
es: Bajo – al menos 30% de la mejor puntuación
fr: Faible – au moins 30% du meilleur score
it: Basso – almeno 30% del miglior punteggio

# flexform.minScoreRatio.medium
source: Medium – at least 50% of best score
de: Mittel – mindestens 50% des besten Scores
es: Medio – al menos 50% de la mejor puntuación
fr: Moyen – au moins 50% du meilleur score
it: Medio – almeno 50% del miglior punteggio

# flexform.minScoreRatio.strict
source: Strict – at least 70% of best score
de: Streng – mindestens 70% des besten Scores
es: Estricto – al menos 70% de la mejor puntuación
fr: Strict – au moins 70% du meilleur score
it: Rigoroso – almeno 70% del miglior punteggio

# flexform.showScore.description
source: Debug mode: displays the similarity score and algorithm badge on each suggestion card.
de: Debug-Modus: zeigt den Ähnlichkeits-Score und den Algorithmus-Badge auf jeder Vorschlagskarte an.
es: Modo depuración: muestra la puntuación de similitud y la insignia del algoritmo en cada tarjeta de sugerencia.
fr: Mode debug : affiche le score de similarite et le badge d'algorithme sur chaque carte de suggestion.
it: Modalità debug: mostra il punteggio di similarità e il badge dell'algoritmo su ogni scheda di suggerimento.

# mode.label
source: Mode:
de: Modus:
es: Modo:
it: Modalità:
